{
    "modelTopology": {
        "keras_version": "2.1.4",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Model",
            "config": {
                "name": "model_1",
                "layers": [
                    {
                        "name": "input_1",
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                64
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_1"
                        },
                        "inbound_nodes": []
                    },
                    {
                        "name": "dense_1",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "units": 32768,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "leaky_re_lu_1",
                        "class_name": "LeakyReLU",
                        "config": {
                            "name": "leaky_re_lu_1",
                            "trainable": true,
                            "alpha": 0.30000001192092896
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "dense_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "reshape_1",
                        "class_name": "Reshape",
                        "config": {
                            "name": "reshape_1",
                            "trainable": true,
                            "target_shape": [
                                16,
                                16,
                                128
                            ]
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_1",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "filters": 256,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "reshape_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "leaky_re_lu_2",
                        "class_name": "LeakyReLU",
                        "config": {
                            "name": "leaky_re_lu_2",
                            "trainable": true,
                            "alpha": 0.30000001192092896
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_transpose_1",
                        "class_name": "Conv2DTranspose",
                        "config": {
                            "name": "conv2d_transpose_1",
                            "trainable": true,
                            "filters": 256,
                            "kernel_size": [
                                4,
                                4
                            ],
                            "strides": [
                                4,
                                4
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "leaky_re_lu_3",
                        "class_name": "LeakyReLU",
                        "config": {
                            "name": "leaky_re_lu_3",
                            "trainable": true,
                            "alpha": 0.30000001192092896
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_transpose_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_2",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "filters": 256,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "leaky_re_lu_4",
                        "class_name": "LeakyReLU",
                        "config": {
                            "name": "leaky_re_lu_4",
                            "trainable": true,
                            "alpha": 0.30000001192092896
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_3",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "filters": 256,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_4",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "leaky_re_lu_5",
                        "class_name": "LeakyReLU",
                        "config": {
                            "name": "leaky_re_lu_5",
                            "trainable": true,
                            "alpha": 0.30000001192092896
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "name": "conv2d_4",
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_4",
                            "trainable": true,
                            "filters": 3,
                            "kernel_size": [
                                7,
                                7
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "activation": "tanh",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 1.0,
                                    "mode": "fan_avg",
                                    "distribution": "uniform",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "inbound_nodes": [
                            [
                                [
                                    "leaky_re_lu_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_1",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "conv2d_4",
                        0,
                        0
                    ]
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1"
            ],
            "weights": [
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        5,
                        5,
                        128,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                }
            ]
        },
        {
            "paths": [
                "group2-shard1of2",
                "group2-shard2of2"
            ],
            "weights": [
                {
                    "name": "conv2d_2/kernel",
                    "shape": [
                        5,
                        5,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                }
            ]
        },
        {
            "paths": [
                "group3-shard1of2",
                "group3-shard2of2"
            ],
            "weights": [
                {
                    "name": "conv2d_3/kernel",
                    "shape": [
                        5,
                        5,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_3/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                }
            ]
        },
        {
            "paths": [
                "group4-shard1of1"
            ],
            "weights": [
                {
                    "name": "conv2d_4/kernel",
                    "shape": [
                        7,
                        7,
                        256,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_4/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                }
            ]
        },
        {
            "paths": [
                "group5-shard1of2",
                "group5-shard2of2"
            ],
            "weights": [
                {
                    "name": "conv2d_transpose_1/kernel",
                    "shape": [
                        4,
                        4,
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_transpose_1/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                }
            ]
        },
        {
            "paths": [
                "group6-shard1of3",
                "group6-shard2of3",
                "group6-shard3of3"
            ],
            "weights": [
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        64,
                        32768
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        32768
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}